[
  {
    "src": "blueprint2024",
    "caption": "The project my team and I made for MIT Blueprint 2024!"
  },
  {
    "src": "deloreanmag",
    "caption": "The Delorean, my nixie clock, was featured in a magazine full of a bunch of other teenagers' cool hardware projects!"
  },
  {
    "src": "earlywonderwalle",
    "caption": "An early version of Wonderwalle, the guitar-playing robot arm."
  },
  {
    "src": "folkcomputer",
    "caption": "Me visiting the Folk Computer! There's an overhead camera that can read an AprilTag and execute code. It can also play music. Literally insane."
  },
  {
    "src": "FRC2025",
    "caption": "Team 1014's 2025 FRC robot for Reefscape! I worked on and led the team that made the grabber arm to pick up and throw algae (real ones know)."
  },
  {
    "src": "gillesvillneuve",
    "caption": "I visited the F1 track in Montreal! Literally broke my brain. I'd been watching these cars race in circle on my computer and to have actual evidence that it was real broke my head. Man it was awesome."
  },
  {
    "src": "JnJ",
    "caption": "The University of Southern California's Liquid Propulsion Lab JnJ rocket engine. Fire."
  },
  {
    "src": "LPL",
    "caption": "I was invited to see USC's Liquid Propulsion Lab hotfire in the Mojave Desert, and it was incredible. I was so lucky to see a rocket engine in real life. I drove a jeep from LA to the Mojave and spent the whole day in the desert watching rocket engines fire. Thanks to the entire LPL team for being so awesome."
  },
  {
    "src": "mad16early",
    "caption": "An early version of my F1 car chassis, the MAD16"
  },
  {
    "src": "mad16research",
    "caption": "One of the pages of notes I made while researching for my F1 car chassis, the MAD16"
  },
  {
    "src": "narrows",
    "caption": "Me at the Zion Narrows in Utah, it was awesome. (I'm looking at nothing)"
  },
  {
    "src": "nycteam",
    "caption": "The Wonderwalle team in new york in progress of making the guitar-playing robot arm. We burnt 6 motors."
  },
  {
    "src": "odyssey",
    "caption": "Odyssey in-progress, with all its guts out on my kitchen counter. I can smell the solder fumes coming out of my computer screen."
  },
  {
    "src": "onevandy",
    "caption": "The mirror ceiling at SUMMIT One Vanderbilt in new york. It was awesome. And bright. Made me feel like spiderman."
  },
  {
    "src": "opticasquirrel",
    "caption": "Early versions of Optica weren't always the most accurate. This version thought the squirrel outside was a Lion (with 36% confidence)."
  },
  {
    "src": "pbrobot",
    "caption": "At the LeRobot Arm Hackathon there was a robot arm that could make peanut butter jelly sandwiches! So fire."
  },
  {
    "src": "undercitybadge",
    "caption": "The PCB badge a fellow hack clubber made for Hack Club's Undercity at GitHub HQ in San Francisco."
  },
  {
    "src": "undercityshop",
    "caption": "I ran the hardware bar/shop at Hack Club's Undercity! I helped everyone out with their projects and gave them parts. I was awake for 28 hours straight."
  },
  {
    "src": "vermontfireworks",
    "caption": "3rd of July fireworks in Burlington, VT over Lake Champlain. Pretty fire. (yes, it was on the 3rd)."
  }
]
